In [1]:
import pandas as pd
import numpy as np
import numpy as np

## 1.

Download the file `allbp.data` from the `Thyroid Disease Data Set` available at https://archive.ics.uci.edu/ml/datasets/Thyroid+Disease (see the files in the `Data Folder`).

Load and preprocess the data so that it is ready for analysis. (Check categorical variables, missing values, variable names and so on.) Use the file `allbp.names` to your advantage.

1. How many observations and how many variables are there in the data?

1. Which variables have missing values? How many?

In [2]:
allbp_columns=[]

with open("allbp.names") as f:
    for line in f.readlines():
        if ":" in line:
            for word in line.split(":"):
                if "." not in word:
                    allbp_columns.append(word)
            
allbp_columns.append("class")     
allbp_columns

['age',
 'sex',
 'on thyroxine',
 'query on thyroxine',
 'on antithyroid medication',
 'sick',
 'pregnant',
 'thyroid surgery',
 'I131 treatment',
 'query hypothyroid',
 'query hyperthyroid',
 'lithium',
 'goitre',
 'tumor',
 'hypopituitary',
 'psych',
 'TSH measured',
 'TSH',
 'T3 measured',
 'T3',
 'TT4 measured',
 'TT4',
 'T4U measured',
 'T4U',
 'FTI measured',
 'FTI',
 'TBG measured',
 'TBG',
 'referral source',
 'class']

In [3]:
# 1
df=pd.read_csv("allbp.data", index_col=None, sep=",",na_values='?', names=allbp_columns)
#print(df.head(2))
print("No of Observations and variables: ", df.shape)

No of Observations and variables:  (2800, 30)

In [4]:
# 2

print(df.isna().sum(), end="\n\n")

# one value is missing from 'age'
# hundreds of values are missing from 'sex', 'TSH', 'T3', etc.

age                             1
sex                           110
on thyroxine                    0
query on thyroxine              0
on antithyroid medication       0
sick                            0
pregnant                        0
thyroid surgery                 0
I131 treatment                  0
query hypothyroid               0
query hyperthyroid              0
lithium                         0
goitre                          0
tumor                           0
hypopituitary                   0
psych                           0
TSH measured                    0
TSH                           284
T3 measured                     0
T3                            585
TT4 measured                    0
TT4                           184
T4U measured                    0
T4U                           297
FTI measured                    0
FTI                           295
TBG measured                    0
TBG                          2800
referral source                 0
class                           0
dtype: int64

In [5]:
print(df.columns[df.isnull().any()])

Index(['age', 'sex', 'TSH', 'T3', 'TT4', 'T4U', 'FTI', 'TBG'], dtype='object')

In [6]:

df.head()

,age,sex,on thyroxine,query on thyroxine,on antithyroid medication,sick,pregnant,thyroid surgery,I131 treatment,query hypothyroid,...,TT4 measured,TT4,T4U measured,T4U,FTI measured,FTI,TBG measured,TBG,referral source,class
0,41.0,F,f,f,f,f,f,f,f,f,...,t,125.0,t,1.14,t,109.0,f,NaN,SVHC,negative.|3733
1,23.0,F,f,f,f,f,f,f,f,f,...,t,102.0,f,NaN,f,NaN,f,NaN,other,negative.|1442
2,46.0,M,f,f,f,f,f,f,f,f,...,t,109.0,t,0.91,t,120.0,f,NaN,other,negative.|2965
3,70.0,F,t,f,f,f,f,f,f,f,...,t,175.0,f,NaN,f,NaN,f,NaN,other,negative.|806
4,70.0,F,f,f,f,f,f,f,f,f,...,t,61.0,t,0.87,t,70.0,f,NaN,SVI,negative.|2807

## 2.

Using the data you prepared above,

1. for each variable that has only yes/no values, calculate the number of `yes` values divided by the number of observations.

1. for each of the `TSH`, `T3`, `TT4`, `T4U`, `FTI` and `TBG` variables, calculate the sum of the squared values divided by the number of non-NA values.

1. calculate the mean ratio between `T3` and `TT4`.

In [7]:
# 1

for col in df.columns:
    yes=0
    total=0
    flag=0
    for row in range(df.shape[0]):
        if(df.loc[row,col] =="t"):
            yes+=1
            total+=1
        elif(df.loc[row,col] =="f"):
            total+=1
        else:
            flag=1
    if(flag==0):
        print("For ",col," the count is ", yes/total)

For  on thyroxine  the count is  0.11785714285714285
For  query on thyroxine  the count is  0.014285714285714285
For  on antithyroid medication  the count is  0.012142857142857143
For  sick  the count is  0.039285714285714285
For  pregnant  the count is  0.014642857142857143
For  thyroid surgery  the count is  0.013928571428571429
For  I131 treatment  the count is  0.017142857142857144
For  query hypothyroid  the count is  0.05821428571428571
For  query hyperthyroid  the count is  0.061785714285714284
For  lithium  the count is  0.005
For  goitre  the count is  0.008928571428571428
For  tumor  the count is  0.025357142857142856
For  hypopituitary  the count is  0.00035714285714285714
For  psych  the count is  0.048214285714285716
For  TSH measured  the count is  0.8985714285714286
For  T3 measured  the count is  0.7910714285714285
For  TT4 measured  the count is  0.9342857142857143
For  T4U measured  the count is  0.8939285714285714
For  FTI measured  the count is  0.8946428571428572
For  TBG measured  the count is  0.0

In [8]:
#for each of the TSH, T3, TT4, T4U, FTI and TBG variables, calculate the sum of the squared values divided by the number of non-NA values.
# 2 

var1=["TSH", "T3", "TT4", "T4U", "FTI", "TBG"]
df_=df[var1]


for col in df_.columns:
    squared_vals_sum=(df_[col].astype(float)**2).sum()
    count_non_na=df_[col].count()
    if count_non_na==0:
        print("Ratio for ",col, " is: ", 0)
    else:
        ratio=squared_vals_sum/count_non_na
        print("Ratio for ",col, " is: ", ratio)

Ratio for  TSH  is:  481.7251481915739
Ratio for  T3  is:  4.780146726862301
Ratio for  TT4  is:  13148.934755351682
Ratio for  T4U  is:  1.0336011330403516
Ratio for  FTI  is:  13354.902247504991
Ratio for  TBG  is:  0

In [9]:
# 3
# calculate the mean ratio between T3 and TT4.

mean_ratio_t3_t4=(df["T3"].astype(float)/df["TT4"].astype(float)).mean()

print(mean_ratio_t3_t4)

0.019673501919946535

## 3.

Load the data available in the file `13-data.csv`.

1. Find invalid values in the data and replace them either with a correct value (if possible) or with NaN.

1. Replace all missing values of the `purchases` variable with zero.

1. Use median imputation to fill in all missing values of the `retention_time` variable.  
(BONUS) Group the observations by `sex` and `location` before calculating the substitute median(s).

In [10]:
df2=pd.read_csv("Data files-20230903/13-data.csv")
df2.head()

      sex  location  purchases  retention_time
0  female  Helsinki        7.0            57.1
1  female  Helsinki        5.0             NaN
2  female     Turku        8.0            50.6
3    male  Helsinki        5.0            31.7
4  female  Helsinki        2.0           120.0

In [11]:
df2.value_counts()

sex     location  purchases  retention_time
female  20100     9.0        95.0              1
male    Helsinki  9.0        1.2               1
                  7.0        16.7              1
                             28.1              1
                             32.9              1
                                              ..
female  Turku     3.0        47.6              1
                             140.1             1
                  4.0        16.6              1
                             56.0              1
nale    Turku     0.0        106.1             1
Length: 169, dtype: int64

In [12]:
# 1
df2.replace("nale","male",inplace=True)
df2.replace("20100","Turku",inplace=True)
df2.replace("33100","Helsinki",inplace=True)

In [13]:
df2.value_counts()

sex     location  purchases  retention_time
female  Helsinki  1.0        20.5              1
male    Helsinki  9.0        7.2               1
                  7.0        28.1              1
                             32.9              1
                             45.5              1
                                              ..
female  Turku     3.0        140.1             1
                  4.0        16.6              1
                             56.0              1
                  5.0        8.9               1
male    Turku     10.0       6.0               1
Length: 169, dtype: int64

In [14]:
df2["retention_time"].unique

<bound method Series.unique of 0       57.1
1        NaN
2       50.6
3       31.7
4      120.0
       ...
195     40.5
196     36.9
197     59.2
198     31.8
199    181.9
Name: retention_time, Length: 200, dtype: float64>

In [15]:
# 2
print(df2.isnull().sum())
print("After changing, the counts become: ")
df2["purchases"].fillna(0, inplace=True)
print(df2.isnull().sum())

sex                0
location           0
purchases          9
retention_time    23
dtype: int64
After changing, the counts become:
sex                0
location           0
purchases          0
retention_time    23
dtype: int64

In [16]:
# 3
df2_imputed=df2.groupby(["sex","location"]).fillna(df2["retention_time"].median())
df2_imputed
#df2_imputed2=df2.fillna(df2["retention_time"].median())
#df2_imputed2

     purchases  retention_time
0          7.0            57.1
1          5.0            32.9
2          8.0            50.6
3          5.0            31.7
4          2.0           120.0
..         ...             ...
195        3.0            40.5
196        3.0            36.9
197        6.0            59.2
198        5.0            31.8
199        6.0           181.9

[200 rows x 2 columns]

## 4.

The files `14-helsinki.csv` and `14-espoo.csv` contain daily numbers of cyclists spotted on selected streets in Helsinki and Espoo. Load the files and merge the data into a single data frame.

1. For how many days were observations made in total?

1. How many observation days were there for each street?

1. On how many days were all streets observed simultaneously?

1. Which street was the busiest in terms of the total number of cyclists?

1. Filter out the dates which have one or more missing values. Does this affect your conclusion about the busiest street? Why or why not?

In [17]:
df_espoo=pd.read_csv("14-espoo.csv")
df_helsinki=pd.read_csv("14-helsinki.csv")
df3=pd.merge(df_espoo,df_helsinki, how="outer")
df3.tail(3)

,date,Gallen-Kallela,Länsiväylä,Länsituulenkuja,Eteläesplanadi,Kaivokatu,Kuusisaarentie,Merikannontie
3131,2022-07-29,NaN,NaN,NaN,1657.0,2770.0,1201.0,1876.0
3132,2022-07-30,NaN,NaN,NaN,1397.0,2058.0,1123.0,1659.0
3133,2022-07-31,NaN,NaN,NaN,1269.0,1919.0,1347.0,2125.0

In [18]:
#1 
print("Total no. of observations: ",df3["date"].size)

Total no. of observations:  3134

In [19]:
#2 

#for each street, observation days
df3.count(axis="rows")[1:]
#df4=df3.fillna(2)
#df4.count(axis="rows")[1:]

Gallen-Kallela     1459
Länsiväylä         1460
Länsituulenkuja    2209
Eteläesplanadi     3072
Kaivokatu          1722
Kuusisaarentie     2640
Merikannontie      2843
dtype: int64

In [20]:
# 3 

print(df3.dropna().index.size)

1400

In [21]:
# 4


streets=df3.iloc[:,1:]
print("The street was the busiest in terms of the total number of cyclists :")
print(streets.sum(axis=0).sort_values(ascending=False).index[0])
#print(streets.dropna(axis=0).sum(axis=0).sort_values(ascending=False).index[0])

The street was the busiest in terms of the total number of cyclists :
Merikannontie

In [22]:
# 5
# Filter out the dates which have one or more missing values. 
#Does this affect your conclusion about the busiest street? Why or why not?

df3_new=df3.dropna(axis= "rows")
streets_new=df3_new.iloc[:, 1:]
streets_new.sum(axis=0).sort_values(ascending=False).index[0]

'Kaivokatu'

If we filter out the dates which have one or more missing values.It affects our conclusion about the busiest street because it changes and becomes Kaivokatu.